{"dosage:acetaminophen:fever:pediatric": "ORAL: 10 to 15 mg/kg orally every 4 to 6 hours as needed not to exceed 5 doses in 24 hours\nAlternatively, use weight first, then age:\nWeight: 2.7 to 5.3 kg (0 to 3 months): 40 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 5.4 to 8.1 kg (4 to 11 months): 80 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 8.2 to 10.8 kg (12 to 23 months): 120 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 10.9 to 16.3 kg (2 to 3 years): 160 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 16.4 to 21.7 kg (4 to 5 years): 240 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 21.8 to 27.2 kg (6 to 8 years): 320 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 27.3 to 32.6 kg (9 to 10 years): 400 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\nWeight: 32.7 to 43.2 kg (11 to 12 years): 480 mg orally every 4 hours as needed not to exceed 5 doses in 24 hours\n12 years or older:\nImmediate-release: 325 mg to 1 g orally every 4 to 6 hours\nMinimum Dosing Interval: every 4 hours\nMaximum Single Dose: 1000 mg\nMaximum Dose: 4000 mg per 24 hours", "interactions:acetaminophen": "Major Interaction: AcetaminophenAlcohol (Ethanol)\nAsk your doctor before using acetaminophen together with ethanol (alcohol).  This can cause serious side effects that affect your liver.  Call your doctor immediately if you experience a fever, chills, joint pain or swelling, excessive tiredness or weakness, unusual bleeding or bruising, skin rash or itching, loss of appetite, nausea, vomiting, or yellowing of the skin or the whites of your eyes.  If your doctor does prescribe these medications together, you may need a dose adjustment or special tests to safely take both medications.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.\n\nModerate Interaction: AcetaminophenNicotine\nConsumer information for this interaction is not currently available.", "dosage:ibuprofen:fever:pediatric": "Oral:\n6 months to less than 24 months:\nInfant Drops (50 mg/1.25 mL):\nWeight 12 to 17 pounds (5.45 to 7.73 kg): 50 mg orally every 6 to 8 hours as needed\nWeight 18 to 23 pounds (8.18 to 10.45 kg): 75 mg orally every 6 to 8 hours as needed\nMaximum: 4 doses per day\n1 year to less than 12 years: 5 to 10 mg/kg orally every 6 to 8 hours as needed\nMaximum dose: 40 mg/kg/day or 4 doses per day\n12 years or older:\nInitial dose: 200 mg orally every 4 to 6 hours as needed\nMay increase to 400 mg every 4 to 6 hours if additional analgesia is needed\nMaximum dose: 1200 mg/day", "interactions:ibuprofen": "Moderate Interaction: IbuprofenAlcohol (Ethanol)\nAsk your doctor before using ibuprofen together with ethanol (alcohol).  Do not drink alcohol while taking ibuprofen.  Alcohol can increase your risk of stomach bleeding caused by ibuprofen.  Call your doctor at once if you have symptoms of bleeding in your stomach or intestines.  This includes black, bloody, or tarry stools, or coughing up blood or vomit that looks like coffee grounds.  It is important to tell your doctor about all other medications you use, including vitamins and herbs.  Do not stop using any medications without first talking to your doctor.\n\nMajor Interaction: IbuprofenHigh Blood Pressure (Hypertension)\nFluid retention and edema have been reported in association with the use of nonsteroidal anti-inflammatory drugs (NSAIDs), including some topical formulations.  NSAIDs (including topicals) can lead to new onset of hypertension or worsening of preexisting hypertension, either of which can contribute to the increased incidence of cardiovascular events.  NSAIDs should be used with caution in patients with preexisting fluid retention, hypertension, or history of heart failure.  NSAIDs should be avoided in patients with severe heart failure unless the benefits are expected to outweigh the risk of worsening heart failure; if an NSAID is used in such patients, they should be monitored for signs of worsening heart failure.  Blood pressure and cardiovascular status should be monitored closely during the initiation of NSAID treatment and throughout the course of therapy."}